{
  "backend/main.mo": "Defines bond, investment, and user profile types with maps and access-controlled queries and updates for profiles and bond listings.",
  "feature_evidence.json": "Feature evidence report describing a logo replacement task with related components and test ID.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend source files and deployment guide contents.",
  "frontend/DEPLOYMENT.md": "Deployment instructions for publishing the app and configuring DNS for fundgrowth.in.",
  "frontend/index.css": "Tailwind base styles defining the full OKLCH color system and theme tokens for light and dark modes.",
  "frontend/index.html": "HTML entry point with root container and script loading the React application.",
  "frontend/src/App.tsx": "Sets up the TanStack Router, route tree, and theme provider for the app.",
  "frontend/src/components/auth/AuthGate.tsx": "Auth-gated wrapper that shows a sign‑in prompt when the user is not authenticated.",
  "frontend/src/components/auth/LoginButton.tsx": "Toggle button handling Internet Identity login and logout with loading states.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new authenticated users to submit basic profile data and KYC status.",
  "frontend/src/components/bonds/BondCard.tsx": "Card UI component rendering core bond details, risk tags, and a link to the bond detail page.",
  "frontend/src/components/bonds/BondFilters.tsx": "UI component providing search, sort, and risk-tag filters for bond listings with clear-filter support.",
  "frontend/src/components/home/FeaturedBonds.tsx": "Fetches and displays the top three bond listings with loading skeletons and a link to view all bonds.",
  "frontend/src/components/layout/AppShell.tsx": "Layout wrapper with header, footer, routed content, and a profile setup modal.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer with navigation links, branding, legal links, and a dynamic attribution section.",
  "frontend/src/components/layout/SiteHeader.tsx": "Responsive header with navigation, authentication-aware UI, and a mobile dropdown menu.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries on change.",
  "frontend/src/hooks/useAuth.ts": "Wraps Internet Identity login/logout logic and exposes authentication status.",
  "frontend/src/hooks/useCallerProfile.ts": "Provides hooks to fetch and update the caller's user profile using the actor API.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and provider managing Internet Identity authentication, state, and AuthClient setup.",
  "frontend/src/hooks/useQueries.ts": "Collection of data-fetching and mutation hooks for bonds, portfolio data, and investment actions via the actor.",
  "frontend/src/index.css": "Defines Tailwind layers, theme CSS variables for light and dark modes, global styles, and a custom container class.",
  "frontend/src/lib/formatters.ts": "Provides formatting utilities for currency, rates, tenure, dates, rating colors, and risk tag labels.",
  "frontend/src/main.tsx": "Initializes the React app with React Query and Internet Identity providers and mounts the root component.",
  "frontend/src/pages/BondDetailPage.tsx": "Displays detailed bond information with rating, status, attributes, and an invest action with authentication handling.",
  "frontend/src/pages/BondsPage.tsx": "Lists all bonds with search, filtering by risk tags, sorting, and renders bond cards.",
  "frontend/src/pages/ContactPage.tsx": "Renders a contact form with submission toast and displays contact information.",
  "frontend/src/pages/DashboardPage.tsx": "Shows authenticated user’s portfolio summary and active investments with stats and tables.",
  "frontend/src/pages/FAQPage.tsx": "Displays an accordion of common FAQs about bonds and platform usage.",
  "frontend/src/pages/HomePage.tsx": "Marketing homepage with hero section, feature list, and featured bonds component.",
  "frontend/src/pages/HowItWorksPage.tsx": "Explains the four-step bond investment process with cards and a section on bond benefits.",
  "frontend/src/pages/InvestPage.tsx": "Handles the authenticated bond investment flow including amount entry, review, confirmation, and success state.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme colors, typography, animations, and plugins.",
  "project_state.json": "Project metadata describing the FUNDGROWTH platform, features, requirements, and version state."
}