{
  "backend/main.mo": "Motoko canister defining bond, investment, and user profile types with access-controlled updates and profile queries.",
  "feature_evidence.json": "Feature evidence listing navigation-related bond quick-link features with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing high-level summaries of all major frontend components, pages, hooks, and utilities.",
  "frontend/DEPLOYMENT.md": "Deployment guide describing prerequisites and steps for deploying FUNDGROWTH to the Internet Computer.",
  "frontend/index.css": "Global Tailwind-based CSS defining color variables, dark mode tokens, and base layout styles.",
  "frontend/index.html": "HTML entry point mounting the React app and loading the main TypeScript bundle.",
  "frontend/src/App.tsx": "Main app router setup using TanStack Router with all defined routes wrapped in a theme provider.",
  "frontend/src/components/auth/AuthGate.tsx": "Auth gate component that restricts content to authenticated users and shows a sign-in prompt otherwise.",
  "frontend/src/components/auth/LoginButton.tsx": "Sign‑in/sign‑out button wired to Internet Identity authentication state.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new authenticated users to create a profile and submit required fields.",
  "frontend/src/components/bonds/BondCard.tsx": "Displays a clickable card showing key bond details such as rating, coupon rate, tenure, minimum investment, and risk tags.",
  "frontend/src/components/bonds/BondFilters.tsx": "Provides UI controls for searching, sorting, and filtering bonds by risk tags.",
  "frontend/src/components/bonds/BondQuickLinks.tsx": "Fetches bond listings and renders quick-access links in desktop or mobile formats.",
  "frontend/src/components/bonds/GoldOfferingsSection.tsx": "Displays a list of predefined gold-backed investment offerings with optional premium tagging.",
  "frontend/src/components/home/FeaturedBonds.tsx": "Empty placeholder component file with no implemented content.",
  "frontend/src/components/layout/AppShell.tsx": "Defines the app layout including header, footer, routed content, and profile setup modal.",
  "frontend/src/components/layout/SiteFooter.tsx": "Renders the footer with navigation links, branding, legal info, and attribution.",
  "frontend/src/components/layout/SiteHeader.tsx": "Renders the responsive site header with navigation, auth display, and bond quick links.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the authenticated or anonymous backend actor and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAuth.ts": "Wraps Internet Identity login/logout logic and exposes authentication state.",
  "frontend/src/hooks/useBonds.ts": "Provides React Query hooks for fetching bond listings and individual bond details via the actor.",
  "frontend/src/hooks/useCallerProfile.ts": "Fetches and saves the authenticated user's profile using React Query and the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication, including loading, login, and clearing identities via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines a React Query hook that fetches the user's portfolio using the authenticated actor.",
  "frontend/src/index.css": "Sets up Tailwind base styles and custom CSS variables for light/dark themes, plus utility classes.",
  "frontend/src/lib/formatters.ts": "Implements formatting helpers for currency, dates, tenure, ratings, and risk-tag labels.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider, then renders App.",
  "frontend/src/pages/BondDetailPage.tsx": "Displays detailed bond information with formatting, loading/error states, and status/risk/repayment labels.",
  "frontend/src/pages/BondsPage.tsx": "Shows a filterable and sortable list of bond listings with search, risk tags, and loading/error handling.",
  "frontend/src/pages/ContactPage.tsx": "Renders a contact form with validation and static contact info, showing a toast on submit.",
  "frontend/src/pages/DashboardPage.tsx": "Renders the investment dashboard, fetching the user's portfolio and displaying totals, active holdings, and a table of investments.",
  "frontend/src/pages/FAQPage.tsx": "Displays a list of frequently asked questions using an accordion layout with answers.",
  "frontend/src/pages/GoldSecuredSeriesPage.tsx": "Empty placeholder page with no implementation.",
  "frontend/src/pages/HomePage.tsx": "Homepage presenting a hero section, platform features, and calls to action for exploring or learning more.",
  "frontend/src/pages/HowItWorksPage.tsx": "Explains the platform's four-step investment process with cards and highlights key benefits.",
  "frontend/src/pages/InvestPage.tsx": "Empty placeholder page with no implementation.",
  "frontend/src/pages/NotFoundPage.tsx": "Simple 404 page informing users the page doesn't exist and linking back to home.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, retrieving, and clearing URL and session parameters with hash support.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, animations, typography, container settings, and plugins for styling and UI behavior.",
  "project_state.json": "Stores project metadata including schema version, feature definitions, new requests, and project context for bond quick‑access links."
}