{
  "backend/main.mo": "Motoko actor defining bond, investment, and user profile types with access-controlled updates and queries including bond date updates and user profile management.",
  "feature_evidence.json": "Feature evidence report listing a new Gold Offerings section on the Bonds page with associated files and metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend files across layout, routing, components, hooks, and utilities.",
  "frontend/DEPLOYMENT.md": "Deployment guide outlining prerequisites and steps for deploying FUNDGROWTH to the Internet Computer.",
  "frontend/index.css": "Tailwind base and theme variable definitions establishing color tokens and styling for light and dark modes.",
  "frontend/index.html": "HTML entry point loading the React app root and main module.",
  "frontend/src/App.tsx": "Main router setup using TanStack Router with all page routes wrapped in a themed AppShell.",
  "frontend/src/components/auth/AuthGate.tsx": "Component that restricts access to authenticated users, showing a sign‑in prompt when needed.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button toggling between sign‑in and sign‑out states using Internet Identity.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting authenticated users without a profile to complete initial profile setup and submit data.",
  "frontend/src/components/bonds/BondCard.tsx": "UI card component displaying key bond details with formatted values and linking to the bond detail page.",
  "frontend/src/components/bonds/BondFilters.tsx": "UI component providing search, sorting, and risk-tag filtering controls for bond listings.",
  "frontend/src/components/bonds/GoldOfferingsSection.tsx": "Displays a grid of predefined gold-backed investment offerings with optional premium tags.",
  "frontend/src/components/home/FeaturedBonds.tsx": "Empty placeholder file for the FeaturedBonds component.",
  "frontend/src/components/layout/AppShell.tsx": "Wraps the main app layout with header, footer, routed content, and a profile setup modal.",
  "frontend/src/components/layout/SiteFooter.tsx": "Renders the site footer with navigation links, branding, and attribution.",
  "frontend/src/components/layout/SiteHeader.tsx": "Builds the responsive site header with navigation, auth UI, and mobile menu handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance, refreshing dependent queries when the identity changes.",
  "frontend/src/hooks/useAuth.ts": "Provides auth helpers using Internet Identity, including login, logout, and authentication state.",
  "frontend/src/hooks/useBonds.ts": "Contains React Query hooks for fetching bond listings and individual bond data via the actor.",
  "frontend/src/hooks/useCallerProfile.ts": "Fetches and saves the authenticated user's profile through actor-backed queries and mutations.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context, login flow, identity persistence, and provider component.",
  "frontend/src/hooks/useQueries.ts": "Exposes a React Query hook for retrieving the user's portfolio summary from the actor.",
  "frontend/src/index.css": "Tailwind base configuration defining theme variables, dark mode values, and shared utility styles.",
  "frontend/src/lib/formatters.ts": "Utility functions for formatting currency, rates, tenure, dates, rating colors, and risk tag labels.",
  "frontend/src/main.tsx": "Initializes React app with React Query and Internet Identity provider and renders the App component.",
  "frontend/src/pages/BondDetailPage.tsx": "Displays detailed information for a specific bond, including status, ratings, and formatted financial data, with loading and error states.",
  "frontend/src/pages/BondsPage.tsx": "Fetches, filters, sorts, and displays a catalog of bond listings with search and risk-tag filtering.",
  "frontend/src/pages/ContactPage.tsx": "Renders a contact form with submission handling and displays platform contact information.",
  "frontend/src/pages/DashboardPage.tsx": "Shows a user’s investment portfolio summary and active holdings, gated behind authentication.",
  "frontend/src/pages/FAQPage.tsx": "Displays a list of frequently asked questions using an accordion layout.",
  "frontend/src/pages/GoldSecuredSeriesPage.tsx": "File is empty and contains no implementation.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section, feature list, and promotional investment highlights.",
  "frontend/src/pages/HowItWorksPage.tsx": "Explains the four investment steps and includes a card detailing benefits of investing with the platform.",
  "frontend/src/pages/InvestPage.tsx": "Empty placeholder page with no implemented content.",
  "frontend/src/pages/NotFoundPage.tsx": "404 page showing a not-found message and a button linking back to the home page.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "TailwindCSS configuration defining theme extensions, colors, animations, and plugins.",
  "project_state.json": "Project metadata describing current features, requests, and state for a bonds page enhancement."
}