{
  "kind": "build_request",
  "title": "Add bond list quick links to the main menu",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the main navigation in the site header to include quick-access entries for individual bond listings (each entry should navigate directly to that bond’s detail route \"/bonds/$bondId\"). The quick-access entries must appear in both desktop navigation and the mobile menu.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "YES",
          "Your bond list is now live — want these entries added to the main menu for quicker access?"
        ]
      },
      "acceptanceCriteria": [
        "On desktop, the header navigation provides access to individual bond listings without first going to the Bonds catalog page.",
        "On mobile, the mobile menu provides access to the same individual bond listing links.",
        "Selecting a bond entry navigates to \"/bonds/<bondId>\" using TanStack Router params (matching the existing BondCard navigation behavior)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Populate the header’s bond quick-access entries dynamically from the existing bond listings query (use the existing React Query hook that fetches bond listings with IDs). Handle loading, empty, and error states gracefully so the header remains usable even when bond data is unavailable.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "YES"
        ]
      },
      "acceptanceCriteria": [
        "When bond listings are still loading, the header does not break and shows a reasonable loading/placeholder state for the bond quick links (or temporarily hides them).",
        "If the bond listings request fails, the header remains functional and does not throw runtime errors; bond quick links are hidden or replaced with a minimal fallback.",
        "If there are zero bond listings, bond quick links are not shown (or an \"No bonds available\" style message is shown in the bond quick-link area), and the rest of navigation works as before."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure the bond quick-access links are visually and interactionally consistent with the current header styling (Tailwind theme tokens) and do not degrade usability when there are many bonds (e.g., constrain the quick-link list area and keep it scannable).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "YES"
        ]
      },
      "acceptanceCriteria": [
        "Bond quick-access UI matches existing header typography/colors and hover/active behaviors.",
        "If the bond list is long, the quick-access UI remains usable (e.g., scrollable list or otherwise constrained) and does not overflow the header or mobile menu layout."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (compose existing shadcn components instead).",
    "Do not edit immutable hook files (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Keep backend architecture unchanged (no new backend services; no external databases)."
  ],
  "nonGoals": [
    "Do not change bond data models, backend storage, or add new bond fields solely for navigation.",
    "Do not add new authentication providers beyond Internet Identity.",
    "Do not redesign the Bonds page catalog, filters, or bond detail page beyond what is required to add header quick links."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}